{
  "#comments-01": [
    "Convention for this example: JSON properties starting with '#' are just",
    "comments, not actual content."
  ],

  "#comments-02": [
    "This example is a single-file appdef"
  ],

  "#comments-base": [
    "Since this is a single-file appdef example, the 'base' is empty. Equivalently,",
    "it could have been omitted. In more complex examples it is the name of another",
    "appdef file (in the same folder), excluding the '.appdef2.json' extension."
  ],
  "base": null,

  "#comments-tobase": [
    "In a full example, appdef files have a chain of base appdefs. The construction",
    "of the actual command to execute involves two passes along all appdef files,",
    "first from the entry appdef toward the root of the base-chain, then back again.",
    "The 'tobase' section contains the edits applied during that first pass, the",
    "'frombase' section the edits applied on the way back.",
    "Since this example only uses a single file and therefore has no base, we can leave",
    "one of those two sections empty (here: 'tobase')."
  ],
  "tobase": {
  },

  "frombase": {
    "#comments-command": [
      "'command' contains the command to execute. This must be an absolute path",
      "In an appdef that uses a base chain (==multi-file appdef), this can be defined",
      "in only one file. An attempt to redefine or replace it is an error. Not",
      "defining it anywhere is an error too"
    ],
    "command": "c:\\bin\\ffmpeg\\bin\\ffmpeg.exe",

    "#comments-prepend-command-path": [
      "'prepend-command-path' is a boolean value that specifies whether or not",
      "to prepend the directory of the executable to the PATH environment variable.",
      "The default is true, but here we set it to false so we can demonstrate",
      "prepending that path explicitly below."
    ],
    "prepend-command-path": false,

    "#comments-vars": [
      "The 'vars' subsection in 'tobase' or 'frombase' describes edits to plain",
      "environment variables (not list-valued environment variables).",
      "Edits can be: adding or replacing a variable (by specifying the new string value),",
      "or removing a variable by specifying its value as 'null'.",
      "In the future more complex edits may use dictionary-valued values"
    ],
    "vars": {
      "FFMPEGPATH": "c:\\bin\\ffmpeg\\bin"
    },

    "#comments-lists": [
      "The 'lists' subsection defines edits to list-valued environment variables, such as PATH.",
      "Each item is keyed by the name of the variable and has a dictionary as value",
      "that specifies operations on that variable."
    ],
    "lists": {
      "PATH": {
        "#comments-sep": [
          "The 'sep' command specifies the separator character to use for the list.",
          "The default for this is operating system dependent: ';' for Windows and",
          "':' for Linux. When in doubt: specify it explicitly, like here."
        ],
        "sep": ";",

        "#comments-prepend": [
          "The 'prepend' command specifies strings to prepend to the list variable."
        ],
        "prepend": [
          "c:\\bin\\ffmpeg\\bin"
        ],

        "#comments-append": [
          "The 'append' command specifies strings to append to the list variable.",
          "Not used here, so the entire 'append' could have been omitted."
        ],
        "append": [
        ]
      }
    },

    "#comments-args": [
      "The 'args' subsection defines the eddits to the argument list. The initial",
      "argument list is based on the original command-line invocation. The 'args'",
      "subsections in the 'tobase' and 'frombase' sections of the appdef files in",
      "the chain can prepend or append values to that list."
    ],
    "args": {
      "#comments-prepend": [
        "The 'prepend' command specifies strings to prepend to the argument list."
      ],
      "prepend": [
        "-hide_banner"
      ]
    }
  }
}
